// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Посмотрите пожалуйста этот файл: task2/obj/Debug/net6.0/task2.AssemblyInfo.cs                              //
// Во время семинара таких ошибок стало ~30 и программы не выполнялись пока я не создал отдельную директорию! //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Console.Write("Введите первое число: ");
int number1 = int.Parse(Console.ReadLine());
Console.Write("Введите второе число: ");         
int number2 = int.Parse(Console.ReadLine());
if (number1 > number2)
{
    Console.Write($"{number1} больше {number2}");
}
if (number2 > number1)
{
    Console.Write($"{number2} больше {number1}");
}
if (number1 == number2)
{
    Console.Write("Числа равны");
}